const data = [
  {
    "id": 1,
    "name": "Элемент списка",
    "childrens": [
      {
        "id": 2,
        "name": "Элемент списка 2 уровня",
        "childrens": [
          {
            "id": 5,
            "name": "Элемент списка 3 уровня",
          },
          {
            "id": 6,
            "name": "Элемент списка 3 уровня",
          },
          {
            "id": 7,
            "name": "Элемент списка 3 уровня",
          }
        ]
      },
      {
        "id": 3,
        "name": "Элемент списка 2",
      },
      {
        "id": 4,
        "name": "Элемент списка 2",
      }
    ]
  }
];

export default data;